Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/employment_rights_and_duties/employer_obligations.html.txt.tmx
Source language: en
Languages: ga

source: Employers' obligations and employees' rights
ga: Oibleagáidí fostóirí agus cearta fostaithe

source: • Contracts and terms of employment
ga: • Conarthaí agus téarmaí fostaíochta

source: • Health and safety in the workplace
ga: • Sláinte agus sábháilteacht san ionad oibre

source: • Disciplinary procedures and dismissal
ga: • Nósanna imeachta smachta agus dhífhostú

source: Employers are responsible for ensuring all their employees receive certain basic employment rights
ga: Tá fostóirí freagrach as a chinntiú go bhfaigheann a bhfostaithe uile roinnt cearta áirithe bunúsacha fostaíochta

source: These rights are governed by detailed employment legislation
ga: Déantar na cearta seo a rialú ag reachtaíocht fostaíochta mhionsonraithe

source: If you employ people or are setting up a business that will employ people you need to be familiar with your responsibilities and your employees’ rights
ga: Má fhostaíonn tú daoine nó má tá gnó á chur ar bun agat a fhostóidh daoine, is gá duit cur amach a bheith agat ar d’fhreagrachtaí agus ar chearta d’fhostaithe

source: Here we outline the responsibilities of employers
ga: Tugaimid breac-chuntas anseo ar fhreagrachtaí fostóirí

source: The focus is on your duties to your employees
ga: Dírítear ar do dhualgais i leith d’fhostaithe

source: You can get more information from the Workplace Relations Commission's Information and Customer Service or from bodies representing your sector such as IBEC (the Irish Business and Employers Confederation) or ISME (Irish Small and Medium Enterprises Assocation) or the Small Firms Assocation
ga: Is féidir leat níos mó faisnéise a fháil ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre nó ó chomhlachtaí a dhéanann ionadaíocht do d’earnáil, ar nós an IBEC (Cónaidhm Ghnólachtaí agus Fhostóirí na hÉireann) nó an ISME (Comhlachas Ghnóthas Beag agus Meánmhéide na hÉireann) nó Comhlachas na nGnólachtaí Beaga

source: The guide for employers, Employment Law Explained (pdf) and the general guide to employment law (pdf) are available on workplacerelations.ie
ga: Tá an treoir d’fhostóirí, Dlí Fostaíochta Mínithe (pdf) agus an Treoir Ar Dhlí Fostaíochta,Comhionannais agus Oibre (pdf) ar fáil ar workplacerelations.ie

source: The Employers' Disability Information Service provides information and advice for employers on employing staff with disabilities
ga: Soláthraíonn an tSeirbhís Fhaisnéise Míchumais d’Fhostóirí faisnéis agus comhairle d’fhostóirí maidir le foireann atá faoi mhíchumas a fhostú

source: Employment services and supports
ga: Seirbhísí agus tacaíochtaí fostaíochta

source: Intreo is a service from the Department of Social Protection that provides a single point of contact for all employment and income supports
ga: Seirbhís ón Roinn Coimirce Sóisialaí is ea Intreo a soláthraíonn pointe teagmhála aonair le haghaidh iomlán tacaíochtaí fostaíochta ioncaim

source: It has a range of services for employers including:
ga: Soláthraíonn Intreo raon seirbhísí d’fhostóirí lena n-áirítear:

source: • The Jobs Ireland employment service giving employers access to jobseekers
ga: • An tseirbhís fhostaíochta Jobs Ireland a thugann rochtain ar chuardaitheoirí poist d’fhostóirí

source: • Financial support for employers creating new and additional jobs through the JobsPlus scheme, JobBridge internships and work placement
ga: • Tacaíocht airgeadais d’fhostóirí a chruthaíonn poist nua agus breise tríd an scéim JobsPlus, intéirneachtaí JobBridge agus socrúcháin oibre

source: • Workplace supports to assist employees with disabilities including the Wage Subsidy Scheme and the Employee Retention Scheme
ga: • Tacaíochtaí ionad oibre chun cabhrú le fostaithe faoi mhíchumas, an Scéim Fóirdheontas Tuarastail agus an Scéim Deontais um Fhostaí a Choinneáil san áireamh

source: Employers engage persons on either contracts of service or contracts for services
ga: Déanann fostóirí daoine a fhostú ar chonarthaí seirbhíse nó ar chonarthaí le haghaidh seirbhísí

source: Only a person engaged under a contract of service is an employee and therefore protected by the full range of employment legislation
ga: Ní fostaí ach duine atá fostaithe faoi chonradh seirbhíse agus ar an ábhar sin, is iad amháin atá cosanta ag an réimse iomlán de reachtaíocht fostaíochta

source: An independent contractor or self-employed person will have a contract for services with the party for whom the work is being done
ga: Beidh ag conraitheoir neamhspleách nó ag duine féinfhostaithe conradh le haghaidh seirbhísí leis an duine a ndéanfar an obair dó/di

source: The distinction between a contract of service, and a contract for services can sometimes be unclear but the type of contract a person is engaged under can have serious implications for both employer and employee in matters such as employment protection legislation, taxation and social welfare
ga: Is féidir leis an idirdhealú atá idir conradh seirbhíse, agus conradh le haghaidh seirbhísí bheith doiléir amanna, ach is féidir leis an gcineál conartha faoinar fostaíodh an duine impleachtaí tromchúiseacha a bheith i gceist don fhostóir agus don fhostaí araon in ábhar ar nós reachtaíocht cosanta fostaíochta, cánach agus leas sóisialach

source: You can find more information in our documents about different types of employment, part-time workers, agency workers and workers on fixed-term or specified purpose contracts
ga: Is féidir tuilleadh faisnéise a fháil inár ndoiciméid faoi chineálacha difriúla fostaíochta, oibrithe páirtaimseartha, oibrithe gníomhaireachta agus oibrithe ar théarmaí seasta nó sainchuspóra

source: Contracts and terms of employment
ga: Conarthaí agus téarmaí fostaíochta

source: While the full contract of employment does not have to be in writing, you must give your employee certain terms and conditions of employment in writing within 2 months of starting employment
ga: Cé nach gá don chonradh iomlán fostaíochta bheith i scríbhinn, ní mór roinnt téarmaí agus coinníollacha fostaíochta a thabhairt do d’fhostaí i scríbhinn laistigh de 2 mhí tar éis don fhostaíocht tosú

source: This information must include the full names of the employer and the employee and details of the job title, the pay, hours of work, notice requirements
ga: Ní mór go n-áireofar san fhaisnéis seo ainmneacha iomlána an fhostóra agus an fhostaí agus sonraí faoi theideal an phoist, an pá, uaireanta oibre, riachtanais fhógraíochta

source: You can read details in our document on the contract of employment
ga: Is féidir leat sonraí a léamh faoi seo inár gcáipéis maidir leis an gconradh fostaíochta

source: While most terms and conditions of employment are stated in a written contract or a company handbook you should be aware that custom and practice in the workplace can also constitute a term of employment, for example, a mid-morning break of 10 minutes
ga: Cé go luaitear an chuid is mó de théarmaí agus coinníollacha fostaíochta i gconradh scríofa nó i lámhleabhar cuideachta, ba cheart duit bheith feasach gur féidir le téarmaí fostaíochta bheith i gceist le nósmhaireacht agus le cleachtas san ionad oibre, mar shampla, sos maidin 10 nóiméad

source: If you, as the employer, wish to change a term or condition of employment you must agree this change with your employee
ga: Más mian leatsa, mar an fostóir, téarma nó coinníoll fostaíochta a athrú, ní mór duit an t-athrú seo a chomhaontú le d’fhostaí

source: This requirement for both the employer’s and the employee’s consent to changes in the terms of the contract is part of contract law
ga: Is cuid den dlí a bhaineann le conarthaí é gur gá toiliú an fhostóra agus an fhostaí araon a fháil le hathruithe a dhéanamh ar théarmaí an chonartha

source: Most experienced adult workers are entitled to be paid a minimum wage of €9.25 per hour
ga: Tá an chuid is mó d’oibrithe fásta ag a bhfuil taithí i dteideal pá íosta €9.25 a fháil in aghaidh na huaire

source: There are however, some exceptions to this minimum wage, including people employed by close relatives, people aged under 18 and trainees or apprentices
ga: Is ann, áfach d’eisceachtaí i leith an phá íosta seo, lena n-áirítear, daoine atá fostaithe ag garghaolta, daoine atá faoi aois 18 mbliana agus daoine faoi oiliúint nó printísigh

source: You must also give your employees payslips showing their wages and any deductions that have been made
ga: Ina theannta sin, ní mór duit duillín pá a thabhairt do d’fhostaithe ina léirítear a bpá agus aon asbhaintí a rinneadh

source: Hours of work, breaks and rest periods
ga: Uaireanta oibre, sosanna agus scíthe

source: You are responsible for ensuring that your employees are given adequate rest
ga: Tá tú freagrach as a chinntiú go bhfaigheann d’fhostaithe scíth leordhóthanach

source: The Organisation of Working Time Act 1997 sets down the rules governing maximum working hours and daily and weekly rest breaks
ga: Leagtar síos san Acht um Eagrú Ama Oibre 1997 rialacha a dhéanann uaireanta uasta oibre agus sosanna laethúla agus seachtainiúla scíthe a rialú

source: Nearly all employees, full-time, part-time, temporary or casual have annual leave and public holiday entitlements from the time they start work
ga: Tá teidlíochtaí saoire bliantúla agus saoire phoiblí ag nach mór an uile fhostaí lánaimseartha, páirtaimseartha agus sealadach nó ócáideach ón tráth a thosaíonn siad obair

source: Most employees are entitled to 4 weeks’ paid annual leave per leave year
ga: Tá an chuid is mó d’fhostaithe i dteideal 4 seachtaine de shaoire bhliantúil sa bhliain as a n-íoctar iad

source: Part-time workers’entitlement is generally calculated as 8% of the hours worked subject to a maximum of 4 working weeks per leave year
ga: Is gnách go ríomhtar teidlíocht oibrithe páirtaimseartha amhail 8% de líon na n-uaireanta a oibríonn siad faoi réir uasmhéid de 4 seachtaine oibre sa bhliain

source: Employers can determine the timing of annual leave, taking into consideration work and personal requirements; however you should consult your employee or their union in advance
ga: Is féidir le fostaithe tráth na saoire bliantúla a dheimhniú, agus aird ar riachtanais oibre agus phearsanta; ba cheart duit dul i gcomhairle le d’fhostaí nó lena gceardchumann ar dtús, áfach

source: Your employee can request pay for annual leave in advance
ga: Is féidir le d'fhostaí pá le haghaidh saoire bhliantúil a iarraidh roimh ré

source: You are also obliged to allow employees to avail of statutory protective leave, such as maternity leave, paternity leave, health and safety leave, parental leave, adoptive leave, and carer’s leave
ga: Ina theannta sin, tá oibleagáid ort ligean d’fhostaithe saoire reachtúil chosanta a fháil, ar nós saoire mháithreachais, saoire atharthachta, saoire shláinte agus shábháilteachta, saoire do thuismitheoirí, saoire uchtaíoch, agus saoire cúramóra

source: There is specific legislation setting down the rules for each entitlement
ga: Is ann do reachtaíocht shonrach ina leagtar síos na rialacha le haghaidh gach teidlíochta

source: You are responsible for deducting the correct amount of tax, PRSI, and Universal Social Charge from your employees' wages and remitting these to Revenue using the PAYE system
ga: Tá tú freagrach as an tsuim cheart de cháin, ÁSPC agus den Mhuirear Sóisialta Uilíoch a asbhaint ó phá d’fhostaithe agus iad seo a íoc leis na Coimisinéirí Ioncaim trí leas a bhaint as an gcóras ÁSPC

source: You also pay employer's PRSI contributions
ga: Íocann tú ranníocaíochtaí ÁSPC fostóra freisin

source: You must register as an employer with Revenue
ga: Ní mór duit clárú mar fhostóir leis na Coimisinéirí Ioncaim

source: The JobsPlus scheme is a employer incentive which encourages and rewards employers who employ jobseekers on the Live Register
ga: Dreasacht fostóra is ea JobsPlus a spreagann fostóirí cuardaitheoirí poist a fhostú atá ar an mBeochlár agus bronnann an dreasacht luaíocht orthu as amhlaidh a dhéanamh

source: It is designed to encourage employers and businesses to employ people who have been out of work for long periods
ga: Tá an dreasacht in ainm is fostóirí agus gnólachtaí a spreagadh chun daoine a fhostú nach raibh ag oibriú ar feadh tréimhsí fada

source: Eligible employers who recruit full-time employees on or after 1 July 2013 may apply for the incentive, which will operate on a pilot basis
ga: Féadfaidh fostóirí incháilithe a dhéanann fostaithe lánaimseartha a earcú an 1 Iúil 2013, nó ina dhiaidh sin, iarratas a dhéanamh ar an dreasacht, a bheidh ag oibriú ar bhonn píolótach

source: The Department of Social Protection will pay the incentive to the employer monthly in arrears over a 2-year period
ga: Íocfaidh an Roinn Coimirce Sóisialaí an dreasacht seo leis an bhfostóir gach mí i riaráistí, thar thréimhse 2 bhliain

source: It will provide 2 levels of regular cash payments:
ga: Cuirfidh an RCS 2 leibhéal d’íocaíochtaí rialta airgid ar fáil:

source: • A payment of €7,500 for each person recruited who has been unemployed for more than 12 but less than 24 months
ga: • Íocaíocht €7,500 le haghaidh gach duine a earcaítear a bhí dífhostaithe ar feadh breis agus 12 mhí ach níos lú ná 24 mí

source: • A payment of €10,000 for each person recruited who has been unemployed for more than 24 months
ga: • Íocaíocht €10,000 le haghaidh gach duine a earcaíodh a bhí dífhostaithe ar feadh breis agus 24 mí

source: You can read the Employer’s Guide to PAYE and recent changes to the PAYE system on the Revenue website
ga: Is féidir leat Treoir an Fhostóra ar an gcóras ÁSPC agus athruithe a rinneadh le déanaí ar an gcóras ÁSPC a léamh ar láithreán gréasáin na gCoimisinéirí Ioncaim

source: You can get information about PRSI from the Department of Social Protection
ga: Is féidir leat faisnéis a fháil faoi ÁSPC ón Roinn Coimirce Sóisialaí

source: As an employer you are required to keep certain records relating to your employees
ga: Mar fhostóir, tá ort taifid áirithe a choimeád lena mbaineann d’fhostaithe

source: This is to show that you are compliant with employment legislation
ga: Seo chun a léiriú go bhfuil an reachtaíocht fostaíochta á comhlíonadh agat

source: Workplace Relations Commission inspectors will require access to these records during an inspection
ga: Teastóidh rochtain ó chigirí an Choimisiúin um Chaidreamh san Áit Oibre ar na taifid seo le linn imscrúdú

source: You can find a guide to how inspections are carried out (pdf) on workplacerelations.ie
ga: Tá treoir maidir le sonraí faoi conas a thugtar faoi imscrúduithe (pdf) ar fáil ar workplacerelations.ie

source: Health and safety in the workplace
ga: Sláinte agus sábháilteacht san ionad oibre

source: Under the Safety, Health and Welfare at Work Act 2005 employers have a duty to ensure employees’safety, health and welfare at work as far as is reasonably practicable
ga: Faoin Acht um Shábháilteacht, Sláinte agus Leas ag an Obair, 2005, tá dualgas ar fhostóirí sábháilteacht, sláinte agus leas fostaithe ag an obair a chinntiú a mhéid agus is praiticiúil go réasúnach

source: In order to prevent workplace injuries and ill health you are required, among other things, to:
ga: D’fhonn gortuithe agus drochshláinte san ionad oibre a chosc, ceanglaítear ort, i measc rudaí eile, an méid seo a leanas a dhéanamh:

source: • Provide and maintain a safe workplace, machinery and equipment
ga: • Ionad oibre, innealra agus trealamh atá sábháilte a chur ar fáil agus a chothabháil

source: • Prevent risks from use of any article or substance and from exposure to physical agents, noise and vibration
ga: • Baol ó úsáid aon ruda nó substainte agus ó bheith nochtaithe d’oibreáin fhisiceacha, do thorann agus do chreathadh a chosc

source: • Prevent any improper conduct or behaviour likely to put the safety,health and welfare of employees at risk (“horseplay” and bullying at work come within these categories)
ga: • Aon iompar nó iompraíocht mhíchuí a chosc ar dócha go gcuirfidís sábháilteacht, sláinte agus leas fostaithe i mbaol (cuimsítear “pleidhcíocht” agus bulaíocht ag an obair laistigh de na catagóirí seo)

source: • Provide instruction and training to employees on health and safety
ga: • Treoir agus oiliúint a chur ar fáil d’fhostaithe maidir le sláinte agus sábháilteacht

source: • Provide protective clothing and equipment to employees (at no cost to employees)
ga: • Éadaí agus trealamh cosanta a thabhairt d’fhostaithe (ar chostas ar bith d’fhostaithe)

source: • Appoint a competent person as the organisation’s Safety Officer
ga: • Duine inniúil a cheapadh mar Oifigeach Sábháilteachta na heagraíochta

source: Every employer is required to carry out a risk assessment for the workplace which should identify any hazards in the workplace, assess the risks arising from such hazards and identify the steps to be taken to deal with any risks
ga: Tá ar gach fostóir tabhairt faoi mheasúnú riosca don ionad oibre inar cheart aon bhaol a shainaithint san ionad oibre, measúnú a dhéanamh ar na rioscaí a eascraíonn ón mbaol sin agus na bearta a shainaithint le dul ina mbun le déileáil le haon bhaol

source: You must also prepare a safety statement based on the risk assessment
ga: Ní mór duit, freisin, ráiteas sábháilteachta a réiteach, bunaithe ar an measúnú riosca

source: The Health and Safety Authority provides tools to help you with these tasks
ga: Cuireann an tÚdarás Sláinte agus Sábháilteachta uirlisí ar fáil, freisin, le cabhrú leat leis na tascanna seo

source: Employers are obliged to report any accident that results in an employee missing 3 consecutive days at work (not including the day of the accident) to the Health and Safety Authority
ga: Tá ar fhostóirí aon teagmhas a thuairisciú a bhíonn ar fhostaí 3 lá oibre i ndiaidh a chéile a ghlacadh saor ón obair dá bharr (ní áirítear lá na timpiste) leis an Údarás Sláinte agus Sábháilteachta

source: Disciplinary procedures and dismissal
ga: Nósanna imeachta smachta agus dhífhostú

source: The Workplace Relations Commission has a Code of Practice: Grievance and Disciplinary Procedures which states that employers should have written grievance and disciplinary procedures
ga: D’fhoilsigh an Coimisiún um Chaidreamh Oibreachais Cód Cleachtais: Nósanna Imeachta um Chasaoid agus Smachta ina luaitear gur cheart go mbeidh ag fostóirí nósanna imeachta um chasaoid agus smachta i scríbhinn

source: Disciplinary procedures set out the stages and process you should follow in relation to alleged shortcomings of an employee
ga: Leagann nósanna imeachta smachta amach na céimeanna agus an próiseas ar cheart duit a leanúint maidir le heasnaimh líomhnaithe fostaí

source: Generally, the procedures allow for informal warnings leading to written warnings and ultimately to dismissal
ga: Go ginearálta, foráiltear sna nósanna imeachta rabhaidh neamhfhoirmiúla as a n-eascraíonn rabhaidh scríofa agus dífhostú faoi dheoidh

source: Under the Unfair Dismissals Acts you are required to give employees written notice of the procedures to be followed before dismissal
ga: Faoi na hAchtanna um Dhífhostú Éagórach, ceanglaítear ort fógra scríofa a thabhairt de na nósanna imeachta atá le leanúint roimh an dífhostú

source: This must be done within 28 days of entering the contract of employment
ga: Ní mór é seo a dhéanamh laistigh de 28 lá tar éis glacadh le conradh fostaíochta

source: You should give employees copies of these at the start of their employment
ga: Ba cheart duit cóipeanna díobh seo a thabhairt d'fhostaithe ag tús a bhfostaíochta

source: If you are considering dismissal you must follow fair procedures
ga: Má tá tú ag smaoineamh ar dhífhostú, ní mór duit na nósanna imeachta seo a leanúint

source: This includes giving your employee appropriate warnings, making them fully aware of the allegations against them and give them an opportunity to present their side
ga: Áirítear leis seo na rabhaidh chuí a thabhairt do d’fhostaí, iad a chur go hiomlán ar an eolas maidir leis na líomhaintí ina leith agus deis a thabhairt dóibh a gcás a léiriú

source: You must also give them the opportunity to be represented in any disciplinary procedures by, for example, a trade union official or other representative
ga: Ní mór an deis a thabhairt dóibh, freisin, go ndéanfaidh oifigeach ceardchumainn nó ionadaí eile, mar shampla, ionadaíocht dóibh in aon nósanna imeachta smachta

source: If you do dismiss an employee you must be able to show that that there were fair grounds for the dismissal and that fair procedures were followed
ga: Má dhífhostaíonn tú fostaí, ní mór duit bheith in ann a léiriú gurbh ann do bhunús cóir leis an dífhostú agus gur leanadh nósanna imeachta córa

source: You can read more in our document on fair grounds for dismissal
ga: Is féidir leat níos mó a léamh faoi inár gcáipéis faoi bhunús córa le dífhostú

source: You can read about redundancy procedures in our document on closing a business
ga: Is féidir leat níos mó a léamh faoi nósanna imeachta iomarcaíochta inár gcáipéis faoi ghnó a dhúnadh
